q = {"1а":30,"2а" : 31, "3а" :32, "4а" : 34}
w = int(input())
if w == 1:
    e = input("введите класс")
    r = input("нужное число")
    q[e] =r
    print("теперь",e, "в классе",r ,"человек")
elif w == 2:
    e = input("введите класс")
    r = input("нужное число")
    q[e] = r
    print("добавлен класс",e,"в нём",r,"человек")
elif w == 3:
    e = input("введите класс")
    q.pop(e)
    print("класс" ,e,"удалён, остались", q)
elif w == 4:
    p = q["1а"]+q["2а"]+q["3а"]+q["4а"]
    print(p)
else:
    print("нет такой коменды")
